espressif/esp-idf/components/soc/esp32c5/include/soc/gdma_reg.h
/** GDMA_OUT_DSCR_CH2_REG register
 *  Current inlink descriptor address of Tx channel 2
 */
#define GDMA_OUT_DSCR_CH2_REG (DR_REG_GDMA_BASE + 0x270)
/** GDMA_OUTLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define GDMA_OUTLINK_DSCR_CH2    0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_CH2_M  (GDMA_OUTLINK_DSCR_CH2_V << GDMA_OUTLINK_DSCR_CH2_S)
#define GDMA_OUTLINK_DSCR_CH2_V  0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_CH2_S  0

/** GDMA_OUT_DSCR_BF0_CH2_REG register
 *  The last inlink descriptor address of Tx channel 2
 */
#define GDMA_OUT_DSCR_BF0_CH2_REG (DR_REG_GDMA_BASE + 0x274)
/** GDMA_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define GDMA_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF0_CH2_M  (GDMA_OUTLINK_DSCR_BF0_CH2_V << GDMA_OUTLINK_DSCR_BF0_CH2_S)
#define GDMA_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF0_CH2_S  0

/** GDMA_OUT_DSCR_BF1_CH2_REG register
 *  The second-to-last inlink descriptor address of Tx channel 2
 */
#define GDMA_OUT_DSCR_BF1_CH2_REG (DR_REG_GDMA_BASE + 0x278)
/** GDMA_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor x-2.
 */
#define GDMA_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF1_CH2_M  (GDMA_OUTLINK_DSCR_BF1_CH2_V << GDMA_OUTLINK_DSCR_BF1_CH2_S)
#define GDMA_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF1_CH2_S  0

/** GDMA_OUT_PRI_CH2_REG register
 *  Priority register of Tx channel 2
 */
#define GDMA_OUT_PRI_CH2_REG (DR_REG_GDMA_BASE + 0x27c)
/** GDMA_TX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel 2. The larger of the value the higher of the priority.
 */
#define GDMA_TX_PRI_CH2    0x0000000FU
#define GDMA_TX_PRI_CH2_M  (GDMA_TX_PRI_CH2_V << GDMA_TX_PRI_CH2_S)
#define GDMA_TX_PRI_CH2_V  0x0000000FU
#define GDMA_TX_PRI_CH2_S  0

/** GDMA_OUT_PERI_SEL_CH2_REG register
 *  Peripheral selection of Tx channel 2
 */
#define GDMA_OUT_PERI_SEL_CH2_REG (DR_REG_GDMA_BASE + 0x280)
/** GDMA_PERI_OUT_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel 0. 0:SPI2. 1: Dummy. 2:
 *  UHCI0. 3: I2S0. 4: Dummy. 5: Dummy. 6: AES. 7: SHA. 8: ADC_DAC. 9: Parallel_IO.
 *  10~15: Dummy
 */
#define GDMA_PERI_OUT_SEL_CH2    0x0000003FU
#define GDMA_PERI_OUT_SEL_CH2_M  (GDMA_PERI_OUT_SEL_CH2_V << GDMA_PERI_OUT_SEL_CH2_S)
#define GDMA_PERI_OUT_SEL_CH2_V  0x0000003FU
#define GDMA_PERI_OUT_SEL_CH2_S  0

/** GDMA_BT_TX_SEL_REG register
 *  Bit scrambler selection
 */
#define GDMA_BT_TX_SEL_REG (DR_REG_GDMA_BASE + 0x284)
/** GDMA_BT_TX_SEL_CH0 : R/W; bitpos: [0]; default: 0;
 *  This register is used to select wiitch tx channel 0 across bit scrambler module
 */
#define GDMA_BT_TX_SEL_CH0    (BIT(0))
#define GDMA_BT_TX_SEL_CH0_M  (GDMA_BT_TX_SEL_CH0_V << GDMA_BT_TX_SEL_CH0_S)
#define GDMA_BT_TX_SEL_CH0_V  0x00000001U
#define GDMA_BT_TX_SEL_CH0_S  0
/** GDMA_BT_TX_SEL_CH1 : R/W; bitpos: [1]; default: 0;
 *  This register is used to select wiitch tx channel 1 across bit scrambler module
 */
#define GDMA_BT_TX_SEL_CH1    (BIT(1))
#define GDMA_BT_TX_SEL_CH1_M  (GDMA_BT_TX_SEL_CH1_V << GDMA_BT_TX_SEL_CH1_S)
#define GDMA_BT_TX_SEL_CH1_V  0x00000001U
#define GDMA_BT_TX_SEL_CH1_S  1
/** GDMA_BT_TX_SEL_CH2 : R/W; bitpos: [2]; default: 0;
 *  This register is used to select wiitch tx channel 2 across bit scrambler module
 */
#define GDMA_BT_TX_SEL_CH2    (BIT(2))
#define GDMA_BT_TX_SEL_CH2_M  (GDMA_BT_TX_SEL_CH2_V << GDMA_BT_TX_SEL_CH2_S)
#define GDMA_BT_TX_SEL_CH2_V  0x00000001U
#define GDMA_BT_TX_SEL_CH2_S  2

/** GDMA_BT_RX_SEL_REG register
 *  Bit scrambler selection
 */
#define GDMA_BT_RX_SEL_REG (DR_REG_GDMA_BASE + 0x288)
/** GDMA_BT_RX_SEL_CH0 : R/W; bitpos: [0]; default: 0;
 *  This register is used to select wiitch rx channel 0 across bit scrambler module
 */
#define GDMA_BT_RX_SEL_CH0    (BIT(0))
#define GDMA_BT_RX_SEL_CH0_M  (GDMA_BT_RX_SEL_CH0_V << GDMA_BT_RX_SEL_CH0_S)
#define GDMA_BT_RX_SEL_CH0_V  0x00000001U
#define GDMA_BT_RX_SEL_CH0_S  0
/** GDMA_BT_RX_SEL_CH1 : R/W; bitpos: [1]; default: 0;
 *  This register is used to select wiitch rx channel 1 across bit scrambler module
 */
#define GDMA_BT_RX_SEL_CH1    (BIT(1))
#define GDMA_BT_RX_SEL_CH1_M  (GDMA_BT_RX_SEL_CH1_V << GDMA_BT_RX_SEL_CH1_S)
#define GDMA_BT_RX_SEL_CH1_V  0x00000001U
#define GDMA_BT_RX_SEL_CH1_S  1
/** GDMA_BT_RX_SEL_CH2 : R/W; bitpos: [2]; default: 0;
 *  This register is used to select wiitch rx channel 2 across bit scrambler module
 */
#define GDMA_BT_RX_SEL_CH2    (BIT(2))
#define GDMA_BT_RX_SEL_CH2_M  (GDMA_BT_RX_SEL_CH2_V << GDMA_BT_RX_SEL_CH2_S)
#define GDMA_BT_RX_SEL_CH2_V  0x00000001U
#define GDMA_BT_RX_SEL_CH2_S  2

#ifdef __cplusplus
}
#endif
